{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "afraid",
    "1": "angry",
    "2": "annoyed",
    "3": "anticipating",
    "4": "anxious",
    "5": "apprehensive",
    "6": "confident",
    "7": "content",
    "8": "devastated",
    "9": "disappointed",
    "10": "disgusted",
    "11": "embarrassed",
    "12": "excited",
    "13": "faithful",
    "14": "grateful",
    "15": "guilty",
    "16": "hopeful",
    "17": "impressed",
    "18": "jealous",
    "19": "joyful",
    "20": "lonely",
    "21": "nostalgic",
    "22": "prepared",
    "23": "proud",
    "24": "sad",
    "25": "sentimental",
    "26": "surprised",
    "27": "trusting",
    "28": "terrified"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "afraid": 0,
    "angry": 1,
    "annoyed": 2,
    "anticipating": 3,
    "anxious": 4,
    "apprehensive": 5,
    "confident": 6,
    "content": 7,
    "devastated": 8,
    "disappointed": 9,
    "disgusted": 10,
    "embarrassed": 11,
    "excited": 12,
    "faithful": 13,
    "grateful": 14,
    "guilty": 15,
    "hopeful": 16,
    "impressed": 17,
    "jealous": 18,
    "joyful": 19,
    "lonely": 20,
    "nostalgic": 21,
    "prepared": 22,
    "proud": 23,
    "sad": 24,
    "sentimental": 25,
    "surprised": 26,
    "terrified": 28,
    "trusting": 27
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.40.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
